<a href="https://colab.research.google.com/github/Dkepffl/2022-1-Lecture_Note/blob/main/Statistical_Methods_for_Big_Data_Analysis/Assignment/Assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

### Problem 1. 정수를 입력받은 후 1부터 입력받은 정수까지 짝수들의 합을 구하는 코드를 작성하고. 결과를 출력하시오.
- 입력값으로 27을 넣은 후 결과값을 첨부할 것.
- for문과 if문을 이용할 것

In [1]:
num = int(input("정수를 입력하시오 : "))
sum = 0

for i in range(num+1):
  if i % 2 == 0:
    sum += i

print(sum)

정수를 입력하시오 : 27
182

### Problem 2. (a) ~ (e) 문제에 답하시오

(a) 1부터 20까지 10개의 정수(난수)를 생성하시오. (random seed : 1886)
(Hint : array를 list로 바꾸는 code는 list_name.tolist() 이다. )

In [10]:
np.random.seed(1886)
randarr = np.random.randint(1,21, size = 10)
list_a = randarr.tolist()
print(list_a )

[7, 14, 20, 2, 10, 5, 5, 4, 11, 4]

(b) (a)의 list(혹은 array)에서 첫번째부터 다섯번째까지의 원소를 출력하시오.

In [11]:
print(list_a[0:5])

[7, 14, 20, 2, 10]

(c) 다음 결과를 출력하도록 하는 Indexing code를 작성하시오.
```python
Out[2] : [14,10, 5]
```

In [52]:
list_c = randarr[[1,4,5]].tolist()
print(list_c)

[14, 10, 5]

(d) 다음 결과를 출력하도록 하는 Indexing code를 작성하시오.
```python
Out[3] : [5, 5, 10, 2, 14, 7]

```

In [78]:
list_d = randarr[::-1]
list_d = list_d[[3,4,5,6,8,9]].tolist()
print(list_d)

[5, 5, 10, 2, 14, 7]

(e) 다음 결과를 출력하도록 하는 Indexing code를 작성하시오
```python
Out[3] : [7, 4]
```

In [63]:
list_e = randarr[[0,-1]].tolist()
print(list_e)

[7, 4]

### Problem 3. (a) ~ (f) 문제에 답하시오

(a) 1 부터 20 사이의 정수에서 난수를 생성하여 데이터 프레임을 만드시오. (random seed : 22)
- size = (5,6) 으로 지정
- colname = [‘col1’, ‘col2’, …, ‘col6’] 으로 지정
- index = [‘row1’, ‘row2’, …, ‘row5’] 으로 지정

In [83]:
np.random.seed(22)
arr1 = np.random.randint(1,21, size = 30)
arr1 = arr1.reshape(5,6)
df_1 = pd.DataFrame(arr1, columns = ['col1', 'col2','col3','col4','col5','col6'], index = ['row1', 'row2', 'row3', 'row4', 'row5'])
df_1

      col1  col2  col3  col4  col5  col6
row1     5    13     1     5     7    12
row2     9     5    19    15    14     8
row3     3    10     9     9     6    16
row4     3    19    18     7    20    20
row5     3     8     8    15    11    10

(b) (a)에서 만든 데이터 프레임에서 마지막 3줄을 출력하시오

In [85]:
print(df_1.tail(3))

      col1  col2  col3  col4  col5  col6
row3     3    10     9     9     6    16
row4     3    19    18     7    20    20
row5     3     8     8    15    11    10

(c) row2와 row3만을 출력하시오

In [88]:
print(df_1.loc[['row2', 'row3']])

      col1  col2  col3  col4  col5  col6
row2     9     5    19    15    14     8
row3     3    10     9     9     6    16

(d) col4와 col5를 출력하시오

In [106]:
print(df_1.loc[:,['col4','col5']])

      col4  col5
row1     5     7
row2    15    14
row3     9     6
row4     7    20
row5    15    11

(e) row3 그리고 col6에 해당하는 데이터를 추출하시오

In [93]:
print(df_1.loc['row3','col6'])

16

(f) col1의 데이터가 5보다 큰 데이터 중에서 col2와 col3만을 추출하시오

In [101]:
print(df_1.loc[df_1['col1']>5,['col2','col3']])

      col2  col3
row2     5    19

### Problem 4. (a) ~ (c) 문제에 답하시오

(a) 다음 인터넷 주소에서 데이터를 불러오시오.
- 데이터 주소 : https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv

In [112]:
df_2 = pd.read_csv('https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv')
df_2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

(b) Survived가 0인 데이터를 추출한 후 처음 4줄만 출력하시오.

In [113]:
df_2.loc[df_2['Survived'] == 0].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

(c)	PassengerId가 5 이상이고 Pclass가 3인 데이터를 추출한 후 마지막 4줄만 출력하시오

In [119]:
df_2.loc[(df_2['PassengerId'] >= 5)&(df_2['Pclass'] == 3)].tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

### Problem 5. (a) ~ (d) 문제에 답하시오.

(a) 입력된 list에서 홀수인 원소만 빼내는 함수를 만드시오.
- 함수 이름은 ‘myodd’로 지정할 것.
- for문과 if문을 이용할 것

In [123]:
def myodd(mylist):
  list_re = []
  for num in mylist:
    if num % 2 != 0:
      list_re.append(num)
  return list_re

(b) (a)에서 만든 함수를 mymodule이라는 이름의 .py로 저장하시오

(c) 1부터 100까지 정수 중에서 20개의 난수를 발생하여 list(혹은 array)를 만드시오. 
(random seed : 777)

In [127]:
np.random.seed(777)
arr2 = np.random.randint(1,101,size = 20)

[48,
 60,
 39,
 88,
 50,
 72,
 30,
 40,
 90,
 47,
 25,
 40,
 19,
 14,
 15,
 33,
 92,
 66,
 83,
 85]

(d) 저장된 mymodule에서 정의된 함수를 이용해서 (c)의 list(혹은 array)에서 홀수인 원소들의
평균을 구하는 example code를 작성하시오

In [135]:
from mymodule import myodd
Mymean = np.mean(myodd(arr2))
print(Mymean)

43.25